src_Extension/DataProcessors/РабочееМестоЛокальныйДиспетчер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоЛокальныйДиспетчер</Name>
			<Comment>Новый</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РабочаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор_Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор_ИзделиеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор_ПодразделениеИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор_Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор_ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводстваПоИзделию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЭтаповПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеИсполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеИзделие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойЭтапПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводстваПоИзделиюПредшествующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЭтаповПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеИсполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзделиеПолуфабрикат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаПредшествующий</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньИерархии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПотребностьИзделийПолуфабрикатовКонечногоЭтапа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src_Extension/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_Extension/DataProcessors/РабочееМестоЛокальныйДиспетчер/Forms/ФормаРедактированияСтроки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтапПроизводства													= Параметры.Ссылка;
	Спецификация														= Параметры.Ссылка.Спецификация;
	Номенклатура														= Параметры.Номенклатура;
	КоличествоУпаковокФактически										= Параметры.КоличествоУпаковокФактически;
	РабочаяДата															= Параметры.РабочаяДата;
	РежимДиалога														= Параметры.РежимДиалога;
	Склад																= Параметры.Склад;
	ДоступныеОстаткиМатериалов.Загрузить(ЗначениеИзСтрокиВнутр(Параметры.ДоступныеОстаткиМатериалов));
	ИдентификаторСтроки													= Параметры.ИдентификаторСтроки;
	
	Если (РежимДиалога = "ВыборНоменклатуры") Тогда
		ЭтаФорма.Заголовок												= "Выберете номенклатуру или разрешенную замену...";
		Элементы.ГруппаОсновное.Видимость								= Ложь;
	КонецЕсли;
	Если (РежимДиалога = "ВводНовойСтроки") Тогда
		ЭтаФорма.Заголовок												= "Заполните данные для добавления новой строки...";
	КонецЕсли;

	ЭтаФорма.ТекущийЭлемент												= Элементы.КоличествоУпаковокФактически;
	
	Заполнить_НоменклатурыСпецификации();

КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого врСтрока Из НоменклатурыСпецификации.ПолучитьЭлементы() Цикл
		идСтроки														= врСтрока.ПолучитьИдентификатор();
		Элементы.НоменклатурыСпецификации.Развернуть(идСтроки, Истина);
	КонецЦикла;
	Если (ЗначениеЗаполнено(Номенклатура)) Тогда
		НайденнаяСтрока													= Неопределено;
		Для Каждого врСтрока01 Из НоменклатурыСпецификации.ПолучитьЭлементы() Цикл
			Если НЕ(НайденнаяСтрока = Неопределено) Тогда Прервать; КонецЕсли;
			Если (врСтрока01.Номенклатура = Номенклатура) Тогда
				НайденнаяСтрока											= врСтрока01;
			КонецЕсли;
			Если НЕ(врСтрока01.ПолучитьЭлементы().Количество() = 0) Тогда
				Для Каждого врСтрока02 Из врСтрока01.ПолучитьЭлементы() Цикл
					Если НЕ(НайденнаяСтрока = Неопределено) Тогда Прервать; КонецЕсли;
					Если (врСтрока02.Номенклатура = Номенклатура) Тогда
						НайденнаяСтрока									= врСтрока02;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если НЕ(НайденнаяСтрока = Неопределено) Тогда
			Элементы.НоменклатурыСпецификации.ТекущаяСтрока				= НайденнаяСтрока.ПолучитьИдентификатор();
			Если (НайденнаяСтрока.ЭтоЗамена) Тогда
					Элементы.ВыбраноПоСпецификации.Видимость			= Ложь;
					Элементы.ВыбраноПоЗамене.Видимость					= Истина;
				Иначе
					Элементы.ВыбраноПоСпецификации.Видимость			= Истина;
					Элементы.ВыбраноПоЗамене.Видимость					= Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НЕ(ЗначениеЗаполнено(Номенклатура)) Тогда
		Номенклатура													= НоменклатурыСпецификации.ПолучитьЭлементы()[0].Номенклатура;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция   ПеренестиВТаблицуНаСервере()
	ВозвращаемаяСтруктура												= Новый Структура;
	ВозвращаемаяСтруктура.Вставить("Ссылка",							ЭтапПроизводства);
	ВозвращаемаяСтруктура.Вставить("Номенклатура",						Номенклатура);
	ВозвращаемаяСтруктура.Вставить("Упаковка",							Номенклатура.ЕдиницаИзмерения);
	ВозвращаемаяСтруктура.Вставить("КоличествоУпаковокФактически",		КоличествоУпаковокФактически);
	ВозвращаемаяСтруктура.Вставить("КоличествоУпаковокВНаличии",		КоличествоУпаковокВНаличии);
	ВозвращаемаяСтруктура.Вставить("КоличествоУпаковокВНаличииТекст",	"");
	ВозвращаемаяСтруктура.Вставить("ИдентификаторСтроки",				Строка(Новый УникальныйИдентификатор()));
	ВозвращаемаяСтруктура.Вставить("ИдентификаторСтрокиПредыдущей",		ИдентификаторСтроки);
	
	Возврат ВозвращаемаяСтруктура;
КонецФункции
&НаКлиенте
Процедура ПеренестиВТаблицу(Команда)
	ВозвращаемаяСтруктура												= ПеренестиВТаблицуНаСервере();
	Закрыть(ВозвращаемаяСтруктура);
	ОповеститьОВыборе(ВозвращаемаяСтруктура);
КонецПроцедуры
&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура НоменклатурыСпецификацииПриАктивизацииСтроки(Элемент)
	ТекущиеДанные														= Элементы.НоменклатурыСпецификации.ТекущиеДанные;
	Если (ТекущиеДанные = Неопределено) Тогда Возврат; КонецЕсли;
	
	Если (ЭтаФорма.ТекущийЭлемент = Элементы.НоменклатурыСпецификации) Тогда
		Номенклатура													= ТекущиеДанные.Номенклатура;
		Если (ТекущиеДанные.ЭтоЗамена) Тогда
				Элементы.ВыбраноПоСпецификации.Видимость				= Ложь;
				Элементы.ВыбраноПоЗамене.Видимость						= Истина;
			Иначе
				Элементы.ВыбраноПоСпецификации.Видимость				= Истина;
				Элементы.ВыбраноПоЗамене.Видимость						= Ложь;
		КонецЕсли;
	КонецЕсли;

	врУпаковка															= ?(ЗначениеЗаполнено(ТекущиеДанные.Упаковка), ТекущиеДанные.Упаковка, ТекущиеДанные.ЕдиницаИзмерения);
	СтруктураОстатков													= ПолучитьТекущийОстаток_ИзТаблицыЗначений(ЭтапПроизводства, ТекущиеДанные.Номенклатура, врУпаковка, КоличествоУпаковокФактически);
	Если (СтруктураОстатков.КоличествоУпаковокВНаличии > 0) Тогда
			КоличествоУпаковокВНаличии									= СтруктураОстатков.КоличествоУпаковокВНаличии;
		Иначе
			КоличествоУпаковокВНаличии									= ПолучитьТекущийОстаток(ТекущиеДанные.Номенклатура);
	КонецЕсли;
		
	ЭтаФорма.ТекущийЭлемент												= Элементы.КоличествоУпаковокФактически;
КонецПроцедуры
&НаСервере
Процедура Заполнить_НоменклатурыСпецификации()
	НоменклатурыСпецификации.ПолучитьЭлементы().Очистить();
	НоменклатурыЗамены.Очистить();
	Для Каждого врСтрока Из Спецификация.МатериалыИУслуги Цикл

		нСтр															= НоменклатурыСпецификации.ПолучитьЭлементы().Добавить();
		нСтр.Номенклатура												= врСтрока.Номенклатура;
		нСтр.Упаковка													= врСтрока.Упаковка;
		нСтр.ЕдиницаИзмерения											= врСтрока.Номенклатура.ЕдиницаИзмерения;
	КонецЦикла;
	Заполнить_НоменклатурыЗамены();
	Для Каждого врСтрока Из НоменклатурыСпецификации.ПолучитьЭлементы() Цикл
		СтруктураОтбора													= Новый Структура;
		СтруктураОтбора.Вставить("НоменклатураЗаменяемая",				врСтрока.Номенклатура);
		НайденныеСтроки													= НоменклатурыЗамены.НайтиСтроки(СтруктураОтбора);
		Если НЕ(НайденныеСтроки.Количество() = 0) Тогда
			Для Каждого врСтрокаН Из НайденныеСтроки Цикл
				нСтр													= врСтрока.ПолучитьЭлементы().Добавить();
				нСтр.Номенклатура										= врСтрокаН.Номенклатура;
				нСтр.Упаковка											= врСтрокаН.Номенклатура.ЕдиницаИзмерения;
				нСтр.ЕдиницаИзмерения									= врСтрокаН.Номенклатура.ЕдиницаИзмерения;
				нСтр.ЭтоЗамена											= Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 
//*************************************************************** 
&НаКлиенте
Процедура ОбновитьФорму()
    ЭлементыФормы = ЭтаФорма.Элементы;
    Для Каждого Элемент Из ЭлементыФормы Цикл
        Если ТипЗнч(Элемент) = Тип("ЭлементыФормы.Строка") Тогда
            // Очищаем значения строк
            Элемент.Очистить();
        КонецЕсли;
    КонецЦикла;
    // Перезагрузка данных формы после обновления
    Заполнить_НоменклатурыСпецификации();
    Заполнить_НоменклатурыЗамены();
КонецПроцедуры
  
&НаКлиенте
Процедура КомандаОткрытьФормуВыбораНоменклатуры(Команда)
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	//ПараметрыФормы.Вставить("МножественныйВыбор",Истина); ///Если хотим несколько значений

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"ПодборРеализации");

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);

КонецПроцедуры

&НаСервере  
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

    Если Значение = Неопределено Тогда 
        Возврат;
    КонецЕсли;
     	нСтр															= НоменклатурыСпецификации.ПолучитьЭлементы().Добавить();
		нСтр.Номенклатура												= Значение.Ссылка;
		нСтр.Упаковка													= Значение.ЕдиницаИзмерения;
		нСтр.ЕдиницаИзмерения											= Значение.ЕдиницаИзмерения;    
    
КонецПроцедуры
//***************************************************************
&НаСервере
Процедура Заполнить_НоменклатурыЗамены()
	Материалы															= Новый СписокЗначений;
	Для Каждого врСтрока Из НоменклатурыСпецификации.ПолучитьЭлементы() Цикл
		Материалы.Добавить(врСтрока.Номенклатура);
	КонецЦикла;
	врЗапрос															= Новый Запрос("ВЫБРАТЬ
	        															               |	АналогиАналоги.Номенклатура КАК Номенклатура,
	        															               |	АналогиМатериалы.Номенклатура КАК НоменклатураЗаменяемая
	        															               |ИЗ
	        															               |	РегистрСведений.АналогиМатериалов КАК АналогиМатериалы
	        															               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиМатериалов КАК АналогиАналоги
	        															               |		ПО АналогиМатериалы.Регистратор = АналогиАналоги.Регистратор
	        															               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбластиДействияАналоговМатериалов КАК ОбластиДействия
	        															               |		ПО АналогиМатериалы.Регистратор = ОбластиДействия.Разрешение
	        															               |ГДЕ
	        															               |	(ОбластиДействия.Спецификация = &Спецификация
	        															               |			ИЛИ ОбластиДействия.Спецификация = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка))
	        															               |	И АналогиМатериалы.Номенклатура В(&Материалы)
	        															               |	И АналогиМатериалы.РольНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.РолиАналогов.Материал), ЗНАЧЕНИЕ(Перечисление.РолиАналогов.ВзаимозаменяемыйАналог))
	        															               |	И АналогиАналоги.РольНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.РолиАналогов.Аналог), ЗНАЧЕНИЕ(Перечисление.РолиАналогов.ВзаимозаменяемыйАналог))
	        															               |	И АналогиМатериалы.Период <= &ДатаНачалаДействия
	        															               |	И (АналогиМатериалы.ПериодЗавершения >= &ДатаОкончанияДействия
	        															               |			ИЛИ АналогиМатериалы.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	        															               |
	        															               |СГРУППИРОВАТЬ ПО
	        															               |	АналогиАналоги.Номенклатура,
	        															               |	АналогиМатериалы.Номенклатура");
	врЗапрос.УстановитьПараметр("Спецификация",							Спецификация);
	врЗапрос.УстановитьПараметр("Материалы",							Материалы);
	врЗапрос.УстановитьПараметр("ДатаНачалаДействия",					КонецДня(РабочаяДата));
	врЗапрос.УстановитьПараметр("ДатаОкончанияДействия",				НачалоДня(РабочаяДата));
	Результат															= врЗапрос.Выполнить();
	Если (Результат.Пустой()) Тогда Возврат; КонецЕсли;

	НоменклатурыЗамены.Загрузить(Результат.Выгрузить());
КонецПроцедуры
&НаСервере
Функция   ПолучитьТекущийОстаток_ИзТаблицыЗначений(ЭтапПроизводства, врНоменклатура, врУпаковка, Знач врКоличествоУпаковокТребуется);
	врКоличествоУпаковокВНаличии									= 0;
	врПроизводитсяВПроцессе											= Ложь;
	КоличествоНайдено												= Ложь;
	ТЧОбеспечение													= ЭтапПроизводства.ОбеспечениеМатериаламиИРаботами;
	Для Каждого врСтрока из ТЧОбеспечение Цикл
		Если (врСтрока.Номенклатура = врНоменклатура) Тогда
			врПроизводитсяВПроцессе									= врСтрока.Производится;
			
			врОтбор													= новый Структура;
			врОтбор.Вставить("Склад",								врСтрока.Склад);
			врОтбор.Вставить("Номенклатура",						врСтрока.Номенклатура);
			врОтбор.Вставить("Назначение",							врСтрока.Назначение);
			НайденныеСтроки											= ДоступныеОстаткиМатериалов.НайтиСтроки(врОтбор);
			Если НЕ(НайденныеСтроки.Количество() = 0) Тогда
				Если (НайденныеСтроки.Количество() = 1) Тогда
						Если (НайденныеСтроки[0].КоличествоУпаковокВНаличии <= 0) Тогда Прервать; КонецЕсли;
						КоличествоНайдено										= Истина;
						Если (НайденныеСтроки[0].Упаковка = врУпаковка) Тогда
								врКоличествоУпаковокВНаличии					= НайденныеСтроки[0].КоличествоУпаковокВНаличии;
								НайденныеСтроки[0].КоличествоУпаковокВНаличии	= НайденныеСтроки[0].КоличествоУпаковокВНаличии - врКоличествоУпаковокТребуется;
							Иначе
								врКоличествоУпаковокВНаличии					= НайденныеСтроки[0].КоличествоУпаковокВНаличии / врУпаковка.Знаменатель * врУпаковка.Числитель;
								врКоличествоУпаковокВНаличииНовое				= врКоличествоУпаковокВНаличии - врКоличествоУпаковокТребуется;
								НайденныеСтроки[0].КоличествоУпаковокВНаличии	= врКоличествоУпаковокВНаличииНовое * врУпаковка.Знаменатель / врУпаковка.Числитель;
						КонецЕсли;
					Иначе
						//Не может быть!
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВозвращаемаяСтруктура											= Новый Структура;
	ВозвращаемаяСтруктура.Вставить("КоличествоУпаковокВНаличии",		врКоличествоУпаковокВНаличии);
	ВозвращаемаяСтруктура.Вставить("КоличествоУпаковокВНаличииТекст",	?(врПроизводитсяВПроцессе И врКоличествоУпаковокВНаличии = 0, "<производится>", ""));
	ВозвращаемаяСтруктура.Вставить("ПроизводитсяВПроцессе",				врПроизводитсяВПроцессе);
	
	Возврат ВозвращаемаяСтруктура;
КонецФункции
&НаСервере
Функция   ПолучитьТекущийОстаток(врНоменклатура)
	врЗапросОстатков													= Новый Запрос("ВЫБРАТЬ
	                													               |	ТоварыНаСкладахОстатки.Склад КАК Склад,
	                													               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                													               |	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	                													               |	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	                													               |	ВЫБОР
	                													               |		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < 0
	                													               |			ТОГДА 0
	                													               |		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	                													               |	КОНЕЦ КАК КоличествоУпаковокВНаличии
	                													               |ИЗ
	                													               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                													               |			&ДатаКон,
	                													               |			Склад = &Склад
	                													               |				И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки");
	врЗапросОстатков.УстановитьПараметр("ДатаКон",						КонецДня(ТекущаяДата()));
	врЗапросОстатков.УстановитьПараметр("Склад",						Склад);
	врЗапросОстатков.УстановитьПараметр("Номенклатура",					врНоменклатура);
	Результат															= врЗапросОстатков.Выполнить();
	Если (Результат.Пустой()) Тогда Возврат 0; КонецЕсли;
	
	Возврат Результат.Выгрузить()[0].КоличествоУпаковокВНаличии;
КонецФункции
